<?php


return [

    'code' => [
        200 => '成功',
        //系统错误
        100000  => '系统错误',
        100001  => '缺少参数',
        100002  => '验证码错误',
        100003  => '账号已存在',
        100004  => '账号不存在',
        100005  => '请先发送验证码',
        100006  => '验证码已失效',
        100007  => '请求频繁,一分钟后再试',//'请求频繁，稍后再试',
        100008  => '密码错误',//'账号或密码错误',
        100009  => '旧密码错误',
        100010  => '已签约，不可预约面试',
        100011  => '账号已禁用,请联系管理员',
        100012  => '账号已绑定,请勿重复绑定',



        1000200 =>  '您还没有登录',
        1000201 =>  '用户信息已失效,请重新登录',
        1000202 =>  '用户不存在或登录信息过期',

        1000300 =>  '未获取到信息,请重第一页开始填写',
        1000301 =>  '未获取到草稿信息',

        2000001 =>  '参数错误',
        2000002 =>  '不能修改自己',
        2000003 =>  '邮箱已存在',
        2000004 =>  '手机号已存在',

        2000005 =>  '参数错误',
        2000006 =>  '图片验证码错误',
        2000007 =>  '账号不存在，请联系管理员。',
        2000008 =>  '记录已存在',

        2000201 =>  '未找到相关记录',
        2000202 =>  '请勿重复创建面试',
        2000203 =>  '请先创建职位',
        2000204 =>  '请勿重复评价',
        2000205 =>  '信息不全，请填写完整后再次提交',
        2000206 =>  '距离面试时间超过30分钟',
        2000207 =>  '房间不存在或已解散',
        2000208 =>  '常用聊天最多保存15条',
        2000209 =>  '未审核通过用户，最多可以创建一条职位信息',
        2000210 =>  '面试时间不能小于当前时间',
        2000211 =>  '您无权下载该外教简历',
        2000212 =>  '您无权下载简历,请开通会员',
        2000213 =>  '您的下载简历次数已达上限',
        2000214 =>  '您还没有提交资料，请提交后再次申请',
        2000215 =>  '置顶失败，您的置顶次数已用尽',
        2000216 =>  '置顶失败，请开通会员',
        2000217 =>  '置顶失败，已经置顶的职位无需再次置顶',
        2000218 =>  '取消置顶失败，已经取消置顶的置顶无需再次置顶',
        2000219 =>  '职位发布失败，您可发布职位数已用尽',
        2000220 =>  '请勿重复提交',
        2000221 =>  '邀请失败，您还不是会员',
        2000222 =>  '邀请失败，您的邀请次数已用尽，请重新开通会员',
        2500001 =>  '您套餐内的急聘服务已用尽，请联系顾问升级套餐！',
        2500002 =>  '您套餐内的精准推送服务已用尽，请联系顾问升级套餐！',
        2500003 =>  '升级会员享有更多会员专属权益！',
        2500004 =>  '升级会员享有更多会员专属权益！',

        ##############管理后台##################
        401         =>  '您没有访问权限',
        1000000     =>  '系统错误',
        1000001     =>  '参数错误',
        1000002     =>  '用户名不能为空',
        1000003     =>  '用户密码不能为空',
        1000004     =>  '账号不存在',
        1000005     =>  '账号或密码错误',
        1000006     =>  '密码验证失败',
        1000007     =>  '关闭失败,还有未过期或未生效的会员',
        #图片上传
        1000100     => '未获取到文件',
        1000101     =>  '上传失败',
        1000102     => '上传失败',
        1000103     => '图片删除失败',

    ],

];